Repository: AArnott/vs-mef
Catalog: src/Microsoft.VisualStudio.Composition.LocalizationShell/MultilingualResources/Microsoft.VisualStudio.Composition.LocalizationShell.*.xlf
Languages: pl, zh_hans, zh_hant

# CannotDirectlyDisposeAnImport
source: This instance is an import and cannot be directly disposed.
pl: To wystąpienie jest importem i nie można go bezpośrednio usunąć.
zh_hans: 此示例为导入，且不可直接释放。
zh_hant: 這是匯入的執行個體，無法直接處置。

# ContainerDisposalEncounteredExceptions
source: Instantiated part(s) threw exception(s) from IDisposable.Dispose().
pl: Części z utworzonymi wystąpieniami zgłosiły wyjątki z elementu IDisposable.Dispose().
zh_hans: 实例化的部件从 IDisposable.Dispose() 中引发异常。
zh_hant: 已個體化的組件從 IDisposable.Dispose() 擲回例外狀況。

# ErrorsDuringDiscovery
source: Errors occurred during discovery.
pl: Wystąpiły błędy podczas odnajdowania.
zh_hans: 在搜索过程中出现错误。
zh_hant: 探索時發生錯誤。

# ErrorsInComposition
source: Errors exist in the composition.
pl: W kompozycji są błędy.
zh_hans: 撰写中存在错误。
zh_hant: 組合中有錯誤。

# ErrorWhileSettingImport
source: Import "{0}" could not be satisfied.
pl: Nie można spełnić wymagań importu „{0}”.
zh_hans: 无法满足导入“{0}”。
zh_hant: 無法完成匯入 "{0}"。

# ExceptionThrownByPartUnderInitialization
source: An exception was thrown while initializing part "{0}".
pl: Zgłoszono wyjątek podczas inicjowania części „{0}”.
zh_hans: 参初始化部件“{0}”时引发了异常。
zh_hant: 初始化組件 "{0}" 時擲回例外狀況。

# ExportedValueNotAssignableToImport
source: Value exported from "{0}" cannot be assigned to import site "{1}".
pl: Nie można przypisać wartości wyeksportowanej z elementu „{0}” do importowanej witryny „{1}”.
zh_hans: 从“{0}”导出的值无法分配到导入站点“{1}”。
zh_hant: 從 "{0}" 匯出的值不得指派給匯入網站 "{1}"。

# FailStableComposition
source: Failed to find a stable composition.
pl: Nie można znaleźć stabilnej kompozycji.
zh_hans: 无法找到稳定的组合。
zh_hant: 找不到穩定的組合。

# FailureWhileScanningType
source: Failure while scanning type "{0}".
pl: Błąd podczas skanowania typu „{0}”.
zh_hans: 扫描类型“{0}”时失败。
zh_hant: 掃描 "{0}" 失敗。

source: No importing constructor.
pl: Brak konstruktora importującego.
zh_hans: 无导入构造函数。
zh_hant: 沒有匯入建構函式。

# PartBelongsToAnotherSharingBoundary
source: Inappropriate request for export from part that belongs to another sharing boundary.
pl: Nieodpowiednie żądanie eksportu pochodzące z części należącej do innej granicy udostępniania.
zh_hans: 从属于其他共享边界的部件导出的请求不合适。
zh_hant: 不應要求從隸屬於其他共用界限的組件匯出。

# PartIsNotInstantiable
source: This part ({0}) cannot be instantiated.
pl: Nie można utworzyć wystąpienia tej części ({0}).
zh_hans: 此部件({0})无法实例化。
zh_hant: 此組件 ({0}) 無法個體化。

# ReflectionTypeLoadExceptionWhileEnumeratingTypes
source: ReflectionTypeLoadException while enumerating types in assembly "{0}". Results will be incomplete.
pl: Wyjątek ReflectionTypeLoadException podczas wyliczania typów w zestawie „{0}”. Wyniki będą niekompletne.
zh_hans: 枚举程序集“{0}”中的类型时，为 ReflectionTypeLoadException。结果将是不完整的。
zh_hant: 列舉組件 "{0}" 中的類型時擲回 ReflectionTypeLoadException。結果將會不完整。

source: Scanning MEF assemblies...
pl: Trwa skanowanie zestawów MEF...
zh_hans: 正在扫描 MEF 组件...
zh_hant: 正在掃描 MEF 組件...

# TypeOfMetadataViewUnsupported
source: Type of metadata view is unsupported.
pl: Typ widoku metadanych jest nieobsługiwany.
zh_hans: 元数据视图类型不受支持。
zh_hant: 不支援此類型的中繼資料檢視。

# UnableToDeterminePrimarySharingBoundary
source: Unable to determine the primary sharing boundary for MEF part "{0}".
pl: Nie można określić podstawowej granicy udostępniania dla części MEF „{0}”.
zh_hans: 无法确定 MEF 部件“{0}”的主要共享边界。
zh_hant: 無法判斷 MEF 組件 "{0}" 的主要共用界限。

# UnableToEnumerateTypes
source: Unable to enumerate types in assembly "{0}".
pl: Nie można wyliczyć typów w zestawie „{0}”.
zh_hans: 无法枚举程序集“{0}”中的类型。
zh_hant: 無法列舉組件 "{0}" 中的類型。

# UnableToInstantiateCustomImportCollectionType
source: Unable to instantiate custom import collection type {0}. Try initializing {1} with a new instance of this type in your importing constructor.
pl: Nie można utworzyć wystąpienia niestandardowego typu kolekcji importu {0}. Spróbuj zainicjować element {1} przy użyciu nowego wystąpienia tego typu w konstruktorze importującym.

# UnableToLoadAssembly
source: Unable to load assembly "{0}" for scanning.
pl: Nie można załadować zestawu „{0}” do przeskanowania.
zh_hans: 无法加载用于扫描的程序集“{0}”。
zh_hant: 無法載入組件 "{0}" 進行掃描。

# UnexpectedMemberType
source: Unexpected member type {0}.
pl: Nieoczekiwany typ elementu członkowskiego {0}.

# UnexpectedNumberOfExportsFound
source: Expected {0} export(s) with contract name "{1}" but found {2} after applying applicable constraints.
pl: Oczekiwano następującej liczby eksportów: {0} z nazwą kontraktu „{1}”, ale po zastosowaniu odpowiednich ograniczeń znaleziono {2}.
zh_hans: 预期具有协定名称“{1}”的 {0} 导出，但在实施相应约束后发现 {2}。
zh_hant: 預期有 {0} 個合約名稱為 "{1}" 的匯出，但在套用適用的條件約束後，卻發現有 {2} 個。

# UnexpectedSharedPartState
source: This shared part is in state {0} but must be in state {1} for this operation.
pl: Ta część udostępniona jest w stanie {0}, ale do wykonania tej operacji jest wymagany stan {1}.
zh_hans: 此共享部件处于 {0} 状态，但是对于此操作必须处于 {1} 状态。
zh_hant: 此共用組件的狀態為 {0}，但此作業需要其狀態為 {1}。

source: All values must be non-null.
pl: Wszystkie wartości muszą być inne niż null.
zh_hans: 所有值必须都为非空。
zh_hant: 所有值必須都不是 Null。

# CannotImportBecauseExportingPartCannotBeInstantiated
source: {0}: cannot import exported value from {1} because the exporting part cannot be instantiated. Is it missing an importing constructor?
pl: {0}: nie można zaimportować wartości wyeksportowanej z elementu {1}, ponieważ nie można utworzyć wystąpienia części eksportującej. Czy brakuje konstruktora importującego?
zh_hans: {0}: 无法导入从 {1} 中导出的值，因为导出部件无法实例化。是否丢失导入构造函数？
zh_hant: {0}: 因為無法個體化匯出的組件，所以無法從 {1} 匯入匯出的值。其是否缺少匯入建構函式?

# CollectionTypeMustDeriveFromICollectionOfT
source: Collection type must derive from ICollection<T>.
pl: Typ kolekcji musi być typem pochodnym typu ICollection<T>.

# ExactlyOneEntryForEveryImport
source: There should be exactly one entry for every import.
pl: Dla każdego importu powinien istnieć dokładnie jeden wpis.
zh_hans: 每个导入应只有一个条目。
zh_hant: 每個匯入只可有一個項目。

# ExpectedExactlyOneExportButFound
source: {0}: expected exactly 1 export matching constraints: {1}but found {2}.{3}
pl: {0}: oczekiwano dokładne 1 eksportu zgodnego z ograniczeniami: {1}ale znaleziono {2}.{3}

# ExpectedOneOrZeroExportsButFound
source: {0}: expected 1 or 0 exports matching constraints: {1}but found {2}.{3}
pl: {0}: oczekiwano 0 lub 1 eksportu zgodnego z ograniczeniami: {1}ale znaleziono {2}.{3}

# ExportOfExportProviderNotAllowed
source: {0}: Export of ExportProvider is not allowed.
pl: {0}: Eksport elementu ExportProvider jest niedozwolony.
zh_hans: {0}: 不允许 ExportProvider 的导出。
zh_hant: {0}: 無法匯出 ExportProvider。

# ImportingCtorHasUnsupportedParameterTypeForImportMany
source: Importing constructor has an unsupported parameter type for an [ImportMany]. Only T[] and IEnumerable<T> are supported.
pl: Konstruktor importujący ma nieobsługiwany typ parametru elementu [ImportMany]. Obsługiwane są tylko typy T[] i IEnumerable<T>.

# ImportsThatUseGenericTypeParametersNotSupported
source: {0}: imports that use generic type parameters are not supported.
pl: {0}: importy, podczas których używane są parametry typu ogólnego, nie są obsługiwane.
zh_hans: {0}: 不支持使用泛型类型参数的导入。
zh_hant: {0}: 不支援使用泛型類型參數的匯入。

# InstanceEmpty
source: This instance is empty.
pl: To wystąpienie jest puste.
zh_hans: 此实例为空。
zh_hant: 此執行個體是空的。

# IsNotAssignableFromExportedMEFValue
source: {0}: is not assignable from exported MEF value {1}.
pl: {0}: nie można przydzielić elementu z wyeksportowanej wartości MEF {1}.
zh_hans: {0}: 不可从导出的 MEF 值 {1} 中分配。
zh_hant: {0}: 無法從匯出的 MEF 值 {1} 指派。

source: Loop between non-shared parts.
pl: Pętla między częściami nieudostępnionymi.
zh_hans: 非共享部件之间循环。
zh_hant: 非共用組件之間的迴圈。

# LoopInvolvingImportingCtorArgumentAndAllNonLazyImports
source: Loop involving ImportingConstructor argument and all non-lazy imports.
pl: Pętla obejmująca argument ImportingConstructor i wszystkie importy bez opóźnień.
zh_hans: 循环涉及 ImportingConstructor 参数和所有非延迟导入。
zh_hant: 迴圈中包含 ImportingConstructor 引數及所有非 Lazy 匯入。

# MetadataTypeNotSupported
source: {0}: metadata type {1} is not supported.
pl: {0}: typ metadanych {1} nie jest obsługiwany.
zh_hans: {0}: 不支持元数据类型 {1}。
zh_hant: {0}: 不支援中繼資料類型 {1}。

source: Not a type spec.
pl: To nie jest specyfikacja typu.
zh_hans: 不是类型规范。
zh_hant: 不是類型規格。

# NotClosedFormOfOther
source: Not a closed form of the other.
pl: To nie jest zamknięty formularz innego elementu.
zh_hans: 不是另一个的关闭窗体。
zh_hant: 不是開始格式的結束格式。

# NotGenericTypeDefinition
source: This is not a generic type definition.
pl: To nie jest definicja typu ogólnego.
zh_hans: 这不是泛型类型的定义。
zh_hant: 這不是泛型類型定義。

source: Not initialized.
pl: Niezainicjowany.
zh_hans: 未初始化。
zh_hant: 並未初始。

source: Part is not shared.
pl: Część nie została udostępniona.
zh_hans: 部件未共享。
zh_hant: 組件未共用。

source: Unresolvable metadata token.
pl: Nierozpoznawalny token metadanych.
zh_hans: 无法解析的元数据标记。
zh_hant: 無法解析的中繼資料語彙基元。

source: Wrong length.
pl: Błędna długość.
zh_hans: 长度错误。
zh_hant: 長度錯誤。

# RecursiveRequestForPartConstruction
source: Unable to construct MEF part "{0}" due to an unresolvable recursive construction request.
pl: Nie można utworzyć części MEF „{0}” z powodu rekursywnego żądania konstrukcji, którego nie można rozpoznać.

source: AssemblyName must be set first.
pl: Najpierw należy ustawić nazwę AssemblyName.
zh_hans: 必须首先设置 AssemblyName。
zh_hant: 必須先設定 AssemblyName。

source: Cannot be empty.
pl: Pusta wartość jest niedozwolona.
zh_hans: 不得为空。
zh_hant: 不得為空白。

# CollectionMustBePublicAndPublicCtorWhenUsingImportingCtor
source: Collection must be public with a public default constructor when used with an [ImportingConstructor].
pl: Kolekcja używana z konstruktorem importującym [ImportingConstructor] musi być publiczna z domyślnym konstruktorem publicznym.

# CompilerErrorsOccurred
source: Compilation errors occurred.
pl: Wystąpiły błędy kompilacji.
zh_hans: 出现编译错误。
zh_hant: 發生編譯錯誤。

# CustomImportSourceNotSupported
source: Custom import sources are not yet supported.
pl: Niestandardowe źródła importu nie są jeszcze obsługiwane.
zh_hans: 尚不支持自定义的导入源。
zh_hant: 目前不支援自訂匯入來源。

# DiscoveredIdenticalPropertiesInMetadataAttributesForPart
source: Member "{0}" contains metadata attributes with an identical property name. Property name: "{1}".
pl: Składowa „{0}” zawiera atrybuty metadanych z identyczną nazwą właściwości. Nazwa właściwości: „{1}”.

# ExportsOnMembersNotAllowedWhenDeclaringTypeGeneric
source: Exports on members not allowed when the declaring type is generic.
pl: Eksporty elementów członkowskich są niedozwolone, jeśli wybrano ogólny typ deklarujący.
zh_hans: 声明类型为泛型时，不允许导出成员。
zh_hant: 當宣告類型為泛型時，無法匯出成員。

source: Failed to generate embeddable types.
pl: Nie można wygenerować typów możliwych do osadzenia.
zh_hans: 无法生成可嵌入的类型。
zh_hant: 無法產生可內嵌的類型。

# ImportConstraintTypeNotSupported
source: The import constraint type {0} is not supported.
pl: Typ ograniczenia importu {0} nie jest obsługiwany.
zh_hans: 不支持导入约束类型 {0}。
zh_hant: 不支援匯入條件約束類型 {0}。

# IsExpectedOnlyOnImportsOfExportFactoryOfT
source: {0} is expected only on imports of ExportFactory<T>.
pl: Element {0} jest oczekiwany tylko w przypadku importów elementu ExportFactory<T>.

# IsExportFactoryExpectedTrue
source: IsExportFactory is expected to be true.
pl: Element IsExportFactory powinien mieć następującą wartość true.
zh_hans: IsExportFactory 预计为 true。
zh_hant: IsExportFactory 應為 true。

# MemberContainsBothImportAndImportMany
source: Member "{0}" contains both ImportAttribute and ImportManyAttribute.
pl: Element członkowski „{0}” zawiera oba atrybuty: ImportAttribute i ImportManyAttribute.
zh_hans: 成员“{0}”包含 ImportAttribute 和 ImportManyAttribute。
zh_hant: 成員 "{0}" 同時包含了 ImportAttribute 及 ImportManyAttribute。

source: No importing constructor found.
pl: Nie znaleziono konstruktora importującego.
zh_hans: 找不到导入构造函数。
zh_hant: 找不到匯入建構函式。

source: No member to satisfy.
pl: Brak elementów członkowskich, których warunki należy spełnić.
zh_hans: 没有成员满足。
zh_hant: 沒有相符的成員。

# OnImportsSatisfiedTakeNoParameters
source: OnImportsSatisfied method should take no parameters.
pl: Metoda OnImportsSatisfied nie powinna przyjmować parametrów.
zh_hans: OnImportsSatisfied 方法不需要参数。
zh_hant: OnImportsSatisfied 方法不應使用任何參數。

source: Only one OnImportsSatisfied method is supported.
pl: Obsługiwana jest tylko jedna metoda OnImportsSatisfied.
zh_hans: 仅支持一个 OnImportsSatisfied 方法。
zh_hant: 僅支援一個 OnImportsSatisfied 方法。

source: Only supported on write operations.
pl: Obsługiwane tylko w przypadku operacji zapisu.
zh_hans: 仅在写入操作中受支持。
zh_hant: 只在寫入作業中才支援。

source: Readable stream required.
pl: Wymagany jest strumień możliwy do odczytania.
zh_hans: 所需的可读取流。
zh_hant: 需要可讀取的資料流。

# TypeMustDefineMemberInfoOrDerivedType
source: Type must be the one that defines memberInfo or a derived type.
pl: Typ musi definiować informacje memberInfo lub typ pochodny.
zh_hans: 类型必须为定义 memberInfo 的类型或派生类型。
zh_hant: 必須是定義 memberInfo 的類型或衍生類型。

# UnexpectedConstraintType
source: Unexpected constraint type: {0}.
pl: Nieoczekiwany typ ograniczenia: {0}.
zh_hans: 意外的约束类型: {0}。
zh_hant: 未預期的條件約束類型: {0}。

# UnsupportedFormat
source: Unsupported format: {0}.
pl: Nieobsługiwany format: {0}.
zh_hans: 不受支持的格式: {0}。
zh_hant: 不支援的格式: {0}。

source: Writable stream required.
pl: Wymagany jest strumień możliwy do zapisania.
zh_hans: 所需的可写入流。
zh_hant: 需要可寫入的資料流。

source: Wrong type.
pl: Błędny typ.
zh_hans: 错误类型。
zh_hant: 類型錯誤。

# TypeAlreadyInCatalogAsAnotherPart
source: The type {0} already belongs to the catalog as a different ComposablePartDefinition.
pl: Typ {0} należy już do wykazu jako inny element ComposablePartDefinition.

# ImportingPropertyHasNoSetter
source: Importing property "{0}" on part "{1}" has no setter.
pl: Właściwość importowania „{0}” w części „{1}” nie ma metody ustawiającej.

# ExportingPropertyHasNoGetter
source: Exporting property "{0}" on part "{1}" has no getter.
pl: Właściwość eksportowania „{0}” w części „{1}” nie ma metody pobierającej.

# ImportManyOnNonCollectionType
source: The type {0} does not appear to be a collection as required for ImportManyAttribute.
pl: Typ {0} nie wygląda na kolekcję, co jest wymagane przez element ImportManyAttribute.

# PartDiscoveryFailedAtMember
source: Part discovery failed at member {0}.
pl: Częściowe odnajdywanie nie powiodło się dla składowej {0}.

# TypeNameWithAssemblyLocation
source: {0}.{1} (in {2})
pl: {0}.{1} (w {2})

source: Unable to instantiate custom import collection type.
zh_hans: 无法实例化自定义导入集合类型。
zh_hant: 無法個體化自訂匯入集合類型。

source: Unexpected member type.
zh_hans: 意外的成员类型。
zh_hant: 未預期的成員類型。

# ExpectedExactlyOneExportButFound
source: {0}: expected exactly 1 export of {1} but found {2}.{3}
zh_hans: {0}: 预期刚好 1 个 {1} 的导出，但发现 {2}。{3}
zh_hant: {0}: 應只有 1 個 {1} 匯出，但卻發現 {2}.{3}

# ExpectedOneOrZeroExportsButFound
source: {0}: expected 1 or 0 exports of {1} but found {2}.{3}
zh_hans: {0}: 预期 1 个或 0 个 {1} 的导出，但发现 {2}。{3}
zh_hant: {0}: {應只有 1 個或 0 個 {1} 的匯出，但卻發現 {2}.{3}

# CollectionMustBePublicAndPublicCtorWhenUsingImportingCtor
source: Collection must be public with a public constructor when used with an [ImportingConstructor].
zh_hans: 配合 [ImportingConstructor] 使用时，集合必须将公共构造函数公开。
zh_hant: 當集合與 [ImportingConstructor] 並用時，必須開放給公用建構函式使用。
